[Demo_Destiny_ep3_1_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[13]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep3_1.GG2_V_DES_ep3_1_002_Cue',Name="エコロ")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[15]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[17]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Sweat_Cue')
DemoScripts[18]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=0,CId=71)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[20]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep3_1.GG2_V_DES_ep3_1_004_Cue',Name="エコロ")
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[22]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[24]=(Actor=WINDOW,Command=EXIT)
DemoScripts[25]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[26]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[27]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[28]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[29]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep3_1_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep3_1_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="我們就重新打起精神,/n開始尋找命運的對象吧!/n艾可蘿!")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="你的情緒真高昂呢--/n不過,能有這樣的氣勢/n對我來說也比較輕鬆就是了.")

Texts[2]=(Label="TEXT03",Name="峯大",Text="一直悶悶不樂,事情也不會有進展!/n倒不如好好享受現在的狀況!")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="要是你太樂在其中的話,/n我作為天使的心情也很複雜......")

Texts[4]=(Label="TEXT05",Name="峯大",Text="好,出發吧!/n前往女孩子的海洋!")

Texts[5]=(Label="",Name="",Text="")

Texts[6]=(Label="SELECT01",Name="",Text="")

Texts[7]=(Label="SELECT02",Name="",Text="")

Texts[8]=(Label="SELECT03",Name="",Text="")

Texts[9]=(Label="SELECT04",Name="",Text="")

Texts[10]=(Label="SELECT05",Name="",Text="")

Texts[11]=(Label="SELECT06",Name="",Text="")

Texts[12]=(Label="SELECT07",Name="",Text="")

Texts[13]=(Label="SELECT08",Name="",Text="")

Texts[14]=(Label="SELECT09",Name="",Text="")

Texts[15]=(Label="SELECT10",Name="",Text="")


